requests/recordTransaction.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://www.wks.io/moneymanager/gen">
    <soapenv:Header>
        <wsse:Security soapenv:mustUnderstand="1"
                       xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
                <wsse:Username>admin</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <gs:recordTransactionRequest>
            <gs:amount>-60.00</gs:amount>
            <gs:category>
                <gs:name>Car</gs:name>
                <gs:name>Cleaning</gs:name>
            </gs:category>
            <gs:date>2020-01-16</gs:date>
            <gs:description>Car wash</gs:description>
        </gs:recordTransactionRequest>
    </soapenv:Body>
</soapenv:Envelope>